; domain
(define (domain locate-victim)

(:requirements :strips :typing)

(:types
    location
)

(:predicates
    (robot-at ?loc - location)
    (victim-at ?loc - location)
    (victim-found)
    (oxygen-supply)
    (connected ?loc1 ?loc2 - location)
)

(:action move 
    :parameters (?from ?to - location)
    :precondition (and 
        (robot-at ?from)
        (connected ?from ?to)
    )
    :effect(and 
        (not(robot-at ?from))
        (robot-at ?to)
)
)

(:action locate 
    :parameters (?loc - location)
    :precondition (and 
        (robot-at ?loc)
        (victim-at ?loc)
    )
    :effect(and 
        (victim-found)
    )
)

(:action rescue
    :parameters (?loc - location)
    :precondition (and 
        (robot-at ?loc)
        (victim-at ?loc)
        (victim-found)
    )
    :effect(and 
        (oxygen-supply)
    )

)
)

; problem
(define(problem locate-victim-1)

(:domain locate-victim)

(:objects 
    room1 room2 room3 room4 room5 - location

)
(:init 
    (connected room1 room2)
    (connected room2 room3)
    (connected room3 room4)
    (connected room4 room5)

    (robot-at room1)
    (victim-at room4)
)

(:goal (and
    (robot-at room4)
    (victim-found)
    (oxygen-supply)
))

)

; plan
1. (move room1 room2)
   deleted: (robot-at room1)
   added: (robot-at room2)
   goals met: 0 of 3
2. (move room2 room3)
   deleted: (robot-at room2)
   added: (robot-at room3)
   goals met: 0 of 3
3. (move room3 room4)
   deleted: (robot-at room3)
   added: (robot-at room4)
   goals met: 1 of 3
4. (locate room4)
   added: (victim-found)
   goals met: 2 of 3
5. (rescue room4)
   added: (oxygen-supply)
   goals met: 3 of 3
